html/D.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>附录D 分享你的代码</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">附录D 分享你的代码</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org49b4d27">1. 在本章：</a></li>
<li><a href="#org140e750">2. 准备源文件</a></li>
<li><a href="#org105265d">3. 文档</a></li>
<li><a href="#org5fa09ae">4. 版权</a></li>
<li><a href="#orga83a736">5. 发布</a></li>
</ul>
</div>
</div>

<div id="outline-container-org49b4d27" class="outline-2">
<h2 id="org49b4d27"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>准备源文件</b><br />
<b>文档</b><br />
<b>版权</b><br />
<b>发布</b><br />
</p>

<p>
如果你写了一个buling buling的新Emacs模式，或者一个特性，或者一个游戏，或者其他什么，你应该秉承自由软件的精神与别人分享它，这可以通过向gnu.emacs.sources新闻组发布来实现。这个附录会向你描述分享Emacs Lisp代码的一些惯例。<br />
</p>
</div>
</div>

<div id="outline-container-org140e750" class="outline-2">
<h2 id="org140e750"><span class="section-number-2">2</span> 准备源文件</h2>
<div class="outline-text-2" id="text-2">
<p>
在你向世界分享你的代码之前，最好对代码进行完整的测试，修复所有你遇到过的bug。通过<a href="C.html">附录C</a>学习更多关于测试和调试的信息。<br />
</p>

<p>
在代码按照你的预想工作之后，你应该向每个源文件的头部添加一个注释块来描述这个文件，它的版权（如下所示），它的作者，它的版本信息，以及其他注释。下面是一个典型的开始：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #75715E;">;;; </span><span style="color: #75715E;">foretell.el -- predict what the user will do</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">Copyright 1996 by Mortimer J. Hacker <a href="mailto:mjh%40mjh.net">&lt;mjh@mjh.net&gt;</a></span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">Foretell is free software distributed under the terms</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">of the GNU General Public License, version 2. For details,</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">see the file COPYING.</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">This is version 1.7 of 5 August 1996.</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">For more information about Foretell, subscribe to the</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;">Foretell mailing list by sending a message to</span>
<span style="color: #75715E;">;;; </span><span style="color: #75715E;"><a href="mailto:foretell-request%40mjh.net">&lt;foretell-request@mjh.net&gt;</a>.</span>
</pre>
</div>

<p>
文件的最后应该有这么一行：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #75715E;">;;; </span><span style="color: #75715E;">foretell.el ends here</span>
</pre>
</div>

<p>
这会在文件用email发出的时候帮助找到文件的边界（后面可能跟着签名和其他内容）。<br />
</p>

<p>
如果你的包含有多个文件，通常要创建一个README文件来描述这个包，里面的文件，以及如何进行安装；然后使用shar程序把所有的文件整合进一个单独的发布文件里。如果你没有shar，你可以获取到一个GNU版本的，具体参照<a href="E.html">附录E</a>。<br />
</p>
</div>
</div>

<div id="outline-container-org105265d" class="outline-2">
<h2 id="org105265d"><span class="section-number-2">3</span> 文档</h2>
<div class="outline-text-2" id="text-3">
<p>
最起码的，你的源文件应该在头部的注释块中有足够的注释，这样用户就能够明白这个文件的作用。如果你的代码是自解释的就更好了&#x2013;也就是说，在你的函数和变量定义时恰当的使用了文档字符串。<br />
</p>

<p>
如果你希望更严肃地编写文档，你可能会考虑为你的包创建一个Textinfo手册。Textinfo是GNU系统的标准文档格式。Textinfo文件可以通过makeinfo程序处理生成Info文件，这种树形的文件可以通过Emacs的Info模式来浏览。Textinfo文件还能通过TEX排版系统处理来生成良好格式的可打印手册。<br />
</p>

<p>
一个很不错的关于如何编写Textinfo手册的Info手册包含在GNU textinfo包里，其中还包含着makeinfo。关于如何获取它以及TEX，参照<a href="E.html">附录E</a>。<br />
</p>
</div>
</div>

<div id="outline-container-org5fa09ae" class="outline-2">
<h2 id="org5fa09ae"><span class="section-number-2">4</span> 版权</h2>
<div class="outline-text-2" id="text-4">
<p>
你可以自由的对你的代码设定任何你想要的版权条款，当然要合法。大多数Emacs Lisp包的作者选择让他们的软件遵循GNU General Public License，一种由自由软件基金会（Free Software Foudation）发起的特殊种类的版权以使它们的软件“自由（free，在权限上，而不是价格上）”。遵循GPL的软件会被确保自由访问，但这对于某些情况并不合适，例如你要把你的软件发布到公共领域（这时，其他人可以合法的拷贝你的软件，修改它，声明这是它自己的，贩售它，并且拒绝继续分发代码）。<br />
</p>

<p>
如果你希望让你的软件基于GPL（一种幽默的称之为使你的软件“copylefting”的过程），你需要把GPL的条款放入到你的源文件里，或者在一个单独的文件里（通常是COPYING）然后在你的每个源文件里引用它（参照本附录开头处的例子）。在Emacs中你可以通过按下M-x describe-copying RET来查看GPL。<br />
</p>
</div>
</div>

<div id="outline-container-orga83a736" class="outline-2">
<h2 id="orga83a736"><span class="section-number-2">5</span> 发布</h2>
<div class="outline-text-2" id="text-5">
<p>
当你的软件已经添加完版权，做好了文档，测试并且调试过，你就可以使用你喜欢的新闻阅读器将你的软件发布到gnu.emacs.sources新闻组里了。确保为你的帖子在Subject:域添加一行有用的描述，并且确保新闻组的读者在有问题或者建议的时候知道如何联系你。注意，向gnu.emacs.sources发布任何除Emacs Lisp代码之外的东西都非常糟糕。对于非代码的发布，使用gnu.misc.discuss。<br />
</p>
</div>
</div>
</div>
</body>
</html>
